**Pandas (Panel Data)**

* Veri manipülasyonu ve veri analizi için yazılmış açık kaynak kodlu bir Python kütüphanesidir.
* Ekonomik ve finansal çalışmalar için doğmuştur.
* Temeli 2008 yılında atılmıştır.
* R DataFrame yapısını Python dünyasına taşımış ve DataFrame'ler üzerinde hızlı ve etkili çalışabilme imkanı sağlamıştır.
* Bir çok farklı veri tipini okuma ve yazma imkanı sağlar.

**Pandas Serisi Oluşturmak**

In [1]:
import pandas as pd

In [6]:
#İlk sutun index
pd.Series([10,82,653,524,15])

0     10
1     82
2    653
3    524
4     15
dtype: int64

In [7]:
seri=pd.Series([10,82,653,524,15])

In [8]:
type(seri)

pandas.core.series.Series

In [10]:
#İndex bilgilerine erişme
seri.axes

[RangeIndex(start=0, stop=5, step=1)]

In [12]:
seri.dtype

dtype('int64')

In [13]:
seri.size

5

In [14]:
seri.ndim

1

In [23]:
seri.values

array([ 10,  82, 653, 524,  15], dtype=int64)

In [24]:
#İlk 3 değeri döndürür.Defaultu 5'tir.
seri.head(3)

0     10
1     82
2    653
dtype: int64

In [25]:
#Son 3 değeri döndürür.Defaultu 5'tir.
seri.tail(3)

2    653
3    524
4     15
dtype: int64

* İndex İsimlendirmesi

In [27]:
pd.Series([10,15,21,65,5])

0    10
1    15
2    21
3    65
4     5
dtype: int64

In [31]:
pd.Series([10,15,21,65,5],index=[1,3,5,7,9])

1    10
3    15
5    21
7    65
9     5
dtype: int64

In [32]:
pd.Series([10,15,21,65,5],index=["a","b","c","d","e"])

a    10
b    15
c    21
d    65
e     5
dtype: int64

In [33]:
seri=pd.Series([10,15,21,65,5],index=["a","b","c","d","e"])

In [35]:
seri["c"]

21

In [36]:
seri["a":"c"]

a    10
b    15
c    21
dtype: int64

* Sozlük üzerinden liste oluşturmak

In [39]:
sozluk={"reg":10,"log":11,"cart":12}

In [40]:
seri=pd.Series(sozluk)

In [42]:
seri

reg     10
log     11
cart    12
dtype: int64

In [43]:
seri["log":"cart"]

log     11
cart    12
dtype: int64

* İki seriyi birleştirerek seri oluşturma

In [44]:
pd.concat([seri,seri])

reg     10
log     11
cart    12
reg     10
log     11
cart    12
dtype: int64

Not: Seriler alt alta eklenir.

* Eleman İşlemleri

In [46]:
import numpy as np

In [50]:
a=np.array([41,24,35,47,55])
seri=pd.Series(a)
seri

0    41
1    24
2    35
3    47
4    55
dtype: int32

In [51]:
seri[0]

41

In [52]:
seri[0:3]

0    41
1    24
2    35
dtype: int32

In [56]:
 seri=pd.Series([121,200,150,99],index=["reg","loj","cart","rf"])

In [57]:
seri

reg     121
loj     200
cart    150
rf       99
dtype: int64

In [59]:
#Sadece index değerlerine erişme
seri.index

Index(['reg', 'loj', 'cart', 'rf'], dtype='object')

In [60]:
#Sadece keys bilgilerini getirir
seri.keys

<bound method Series.keys of reg     121
loj     200
cart    150
rf       99
dtype: int64>

In [62]:
list(seri.items())

[('reg', 121), ('loj', 200), ('cart', 150), ('rf', 99)]

In [63]:
seri.values

array([121, 200, 150,  99], dtype=int64)

* Eleman sorgulama

In [65]:
#"reg" değerinin seride olup olmadığını sorgular.
"reg" in seri

True

In [67]:
"a" in seri

False

In [68]:
seri["reg"]

121

* Fancy ile eleman seçme

In [71]:
seri[["rf","reg"]]

rf      99
reg    121
dtype: int64

In [72]:
seri["reg"]=130

In [73]:
seri

reg     130
loj     200
cart    150
rf       99
dtype: int64

In [76]:
seri["reg":"loj"]

reg    130
loj    200
dtype: int64

**Pandas Dataframe**

* Pandas DataFrame Oluşturma

In [3]:
l=[1,2,39,67,95]
l

[1, 2, 39, 67, 95]

In [6]:
pd.DataFrame(l,columns=["degisken_ismi"])

   degisken_ismi
0              1
1              2
2             39
3             67
4             95

In [11]:
import numpy as np
m=np.arange(1,10).reshape((3,3))
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [13]:
pd.DataFrame(m,columns=["var1","var2","var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [14]:
#df isimlendirme

In [15]:
df=pd.DataFrame(m,columns=["var1","var2","var3"])

In [16]:
df

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [18]:
df.head(1)

   var1  var2  var3
0     1     2     3

In [20]:
df.columns=("deg1","deg2","deg3")

In [21]:
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [22]:
type(df)

pandas.core.frame.DataFrame

In [24]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [25]:
df.shape

(3, 3)

In [26]:
df.ndim

2

In [27]:
df.size

9

In [29]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [30]:
type(df.values)

numpy.ndarray

In [31]:
df.head()

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [32]:
df.tail(1)

   deg1  deg2  deg3
2     7     8     9

In [33]:
a=np.array([1,2,3,4,5])

In [35]:
pd.DataFrame(a,columns=["deg1"])

   deg1
0     1
1     2
2     3
3     4
4     5

* Eleman İşlemleri

In [36]:
s1 =np.random.randint(10,size=5)
s2 =np.random.randint(10,size=5)
s3 =np.random.randint(10,size=5)

In [37]:
s1

array([6, 2, 5, 2, 7])

In [38]:
s2

array([3, 4, 7, 4, 2])

In [39]:
s3

array([7, 7, 3, 0, 0])

In [40]:
sozluk={"var1":s1,"var2":s2,"var3":s3}

In [41]:
sozluk

{'var1': array([6, 2, 5, 2, 7]),
 'var2': array([3, 4, 7, 4, 2]),
 'var3': array([7, 7, 3, 0, 0])}

In [42]:
df=pd.DataFrame(sozluk)

In [43]:
df

   var1  var2  var3
0     6     3     7
1     2     4     7
2     5     7     3
3     2     4     0
4     7     2     0

In [44]:
df[0:1]

   var1  var2  var3
0     6     3     7

In [45]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [46]:
df.index=["a","b","c","d","e"]

In [47]:
df

   var1  var2  var3
a     6     3     7
b     2     4     7
c     5     7     3
d     2     4     0
e     7     2     0

In [49]:
df["c":"e"]

   var1  var2  var3
c     5     7     3
d     2     4     0
e     7     2     0

In [50]:
#silme

In [64]:
df.drop("a",axis=0)

   var1  var2  var3      var4
b     2     4     7  0.500000
c     5     7     3  0.714286
d     2     4     0  0.500000
e     7     2     0  3.500000

In [65]:
df

   var1  var2  var3      var4
a     6     3     7  2.000000
b     2     4     7  0.500000
c     5     7     3  0.714286
d     2     4     0  0.500000
e     7     2     0  3.500000

In [66]:
l=["var1","var5","var2"]

In [67]:
for i in l:
    print(i in df)

True
False
True

In [68]:
df["var1"]

a    6
b    2
c    5
d    2
e    7
Name: var1, dtype: int32

In [61]:
df["var4"]=df["var1"] / df["var2"]
df

   var1  var2  var3      var4
a     6     3     7  2.000000
b     2     4     7  0.500000
c     5     7     3  0.714286
d     2     4     0  0.500000
e     7     2     0  3.500000

In [70]:
#degisken silmek
df.drop("var4",axis=1)

   var1  var2  var3
a     6     3     7
b     2     4     7
c     5     7     3
d     2     4     0
e     7     2     0

In [71]:
df

   var1  var2  var3      var4
a     6     3     7  2.000000
b     2     4     7  0.500000
c     5     7     3  0.714286
d     2     4     0  0.500000
e     7     2     0  3.500000

In [72]:
df.drop("var4",axis=1,inplace=True)

In [73]:
df

   var1  var2  var3
a     6     3     7
b     2     4     7
c     5     7     3
d     2     4     0
e     7     2     0

In [75]:
l=["var1","var2"]

In [76]:
df.drop(l,axis=1)

   var3
a     7
b     7
c     3
d     0
e     0

* Gözlem ve Değişken Seçimi: loc & iloc

In [77]:
m=np.random.randint(1,30,size=(10,3))
df=pd.DataFrame(m,columns=["var1","var2","var3"])
df

   var1  var2  var3
0    29    10     9
1     9    19    28
2    22    28    28
3     2     6     3
4     3    19    22
5     1    19    21
6    19    17    13
7    18     8     8
8    23     3    26
9    28     3    13

In [78]:
#loc: Tanımlandığı şekli ile seçim yapmak için kullanılır.

In [80]:
df.loc[0:3]

   var1  var2  var3
0    29    10     9
1     9    19    28
2    22    28    28
3     2     6     3

In [81]:
#iloc: Alışık olduğumuz indexleme mantığı ile seçim yapar.

In [82]:
df.iloc[0:3]

   var1  var2  var3
0    29    10     9
1     9    19    28
2    22    28    28

In [84]:
df.iloc[0,0]

29

In [87]:
df.iloc[:3,:2]

   var1  var2
0    29    10
1     9    19
2    22    28

In [88]:
df.loc[0:3,"var3"]

0     9
1    28
2    28
3     3
Name: var3, dtype: int32

In [92]:
df.iloc[0:3]["var3"]

0     9
1    28
2    28
Name: var3, dtype: int32

* Koşullu Eleman Seçimi